# ZoneDesignCoolTemperature Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZoneDesignCoolTemperature Property
ParameterTypeId Class See Also
---
"Design Temperature for Cooling"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZoneDesignCoolTemperature { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneDesignCoolTemperature As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZoneDesignCoolTemperature {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace